/**************************************************************************

Copyright:陕西恒巨软件科技有限公司

Author: 李涛

Date: 2018-12-29

Description: 包含具有图形表示的实体的创建操作

**************************************************************************/
#ifndef OD_QT_ENTITY_H_
#define OD_QT_ENTITY_H_


#include "Ge\GePoint3d.h"
#include "DbEntity.h"
#include "Gs\GsFiler.h"
#include "DbDimStyleTableRecord.h"

class CreateEnt
{
public:
	/*====================================================================================
	功能：绘制直线
	-------------------------------------------------------------------------------------
	参数1       线段起点
	参数2       线段终点
	参数3       线段颜色
	=====================================================================================*/
	static OdDbObjectId dLine(const OdGePoint3d& ptStart, const OdGePoint3d& ptEnd, int colorIndex = 1);

	/*====================================================================================
	功能：绘制2d多段线
	-------------------------------------------------------------------------------------
	参数1       多段线点集
	参数2       是否闭合
	参数3       多段线颜色
	=====================================================================================*/
	static OdDbObjectId d2dPolyLine(const OdGePoint2dArray& ptSet, bool isClosed = false, int colorIndex = 0);

	/*====================================================================================
	功能：绘制2d矩形
	-------------------------------------------------------------------------------------
	参数1       矩形中心位置
	参数2       边长
	参数3       矩形颜色
	=====================================================================================*/
	static OdDbObjectId d2dSqure(const OdGePoint3d& ptCenter, double lenght, int colorIndex = 0);

	/*====================================================================================
	功能：绘制圆
	-------------------------------------------------------------------------------------
	参数1       圆心位置
	参数2       半径
	参数3       圆颜色
	=====================================================================================*/
	static OdDbObjectId dCircle(const OdGePoint3d& ptCenter, double radius, int colorIndex = 2);

	/*====================================================================================
	功能：绘制弧
	-------------------------------------------------------------------------------------
	参数1       弧心位置
	参数2       半径
	参数3       起始弧度
	参数4       终止弧度
	参数5       弧颜色
	=====================================================================================*/
	static OdDbObjectId dArc(const OdGePoint3d& ptCenter, double radius, double startAngle,
							 double endAngel, int colorIndex = 2);
	
	/*====================================================================================
	功能：绘制文本
	-------------------------------------------------------------------------------------
	参数1       标注信息位置
	参数2       标注起点
	参数3       标注终点
	参数4       标注样式
	=====================================================================================*/
	static OdDbObjectId dText(const OdGePoint3d& point3d, const OdString& text, double height = 10,
							  int colorIndex = 2);
	
	// TODO: 标注样式参数类型为箭头样式，需修改
	/*====================================================================================
	功能：绘制对齐标注
	-------------------------------------------------------------------------------------
	参数1       标注信息位置
	参数2       标注起点
	参数3       标注终点
	参数4       标注样式 
	=====================================================================================*/
	static OdDbObjectId dAlignedDimension(const OdGePoint3d& dimLinePt, const OdGePoint3d& ptStart,
										  const OdGePoint3d& ptEnd, OdDbObjectId dimStyleId);

	/*====================================================================================
	功能：获取数据库
	=====================================================================================*/
	static OdDbDatabase* getDataBase();

	// TODO: 只写了Hidden线型
	/*====================================================================================
	功能：添加线型
	=====================================================================================*/
	static OdDbObjectId addHiddenLineType();


private:
	/*====================================================================================
	功能：添加到模型空间
	-------------------------------------------------------------------------------------
	参数1      所要添加的实体
	=====================================================================================*/
	static OdDbObjectId addToModelSpace(OdDbEntity *entity);

	
};

#endif